# Pandas : 
explore data , manipulate data and get it ready for Data Analysis <br>

<b>Why Pandas ?</b> <br>
>Simple to use <br>
> Integrated with many other data science & Ml python tools<br>
> Helps you get data ready for machine learning<br>


<b>What are we going to cover in this section :</b> <br>
>Most useful functions<br>
>Pandas Datatypes<br>
>Importing & exporting data<br>
>Describing data ## statiscally <br>
>Viewing & selecting data<br>
>Manipulating data<br>

In [1]:
import pandas as pd ##importing Pandas in jupyter notebook

In [2]:
# 2 main data Types
series = pd.Series(["BMW","HONDA","AUDI"]) ## here after pd.(Series "S" should be capital)

In [3]:
series ## series is a 1D <column>

0      BMW
1    HONDA
2     AUDI
dtype: object

In [4]:
colours = pd.Series(["RED","Yellow","BLUE"])
colours

0       RED
1    Yellow
2      BLUE
dtype: object

In [5]:
#DataFrame is 2 dimesional 
##More oftern used
## It takes a Python Dictionary
car_data = pd.DataFrame({"car make "  : series,"Colour":colours})
car_data

  car make   Colour
0       BMW     RED
1     HONDA  Yellow
2      AUDI    BLUE

In [6]:
## Import Data
car_sales = pd.read_csv ("car-sales.csv")
car_sales
#reading car-sales.csv to the variable car_sales
#csv = comma seperated values
#row is reffered to axis  = 0 
#column is referred to axis  =1
#the contents of this tables are called Data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [7]:
#Exporting a DataFrame
car_sales.to_csv("exported-car-sales.csv")
#can also export it to excel by  .to_excel

In [8]:
ls

 Volume in drive C is Windows
 Volume Serial Number is 36A3-5FA6

 Directory of C:\Users\test\Desktop\ML_Sample_UdemyCourse\Pandas

11/04/2020  11:16 PM    <DIR>          .
11/04/2020  11:16 PM    <DIR>          ..
11/04/2020  04:03 PM    <DIR>          .ipynb_checkpoints
11/03/2020  05:49 PM           332,025 6-step-ml-framework.png
11/04/2020  02:51 PM               369 car-sales.csv
11/04/2020  03:58 PM                 0 cd
11/03/2020  05:22 PM               116 debug.log
11/04/2020  11:16 PM               392 exported-car-sales.csv
11/03/2020  05:49 PM            11,328 heart-disease.csv
11/04/2020  04:04 PM            18,727 JupyterWalkthrough1.ipynb
11/04/2020  11:16 PM             4,804 Pandas1.ipynb
11/04/2020  03:03 PM           341,236 pandas-anatomy-of-a-dataframe.png
               9 File(s)        708,997 bytes
               3 Dir(s)  863,100,235,776 bytes free

In [9]:
car_sales.to_csv("exported-indexFalsed-car-sales.csv",index = False)
car_sales.to_csv("exported-indexTrue-car-sales.csv",index = True)##adding an index column
# here we are telling python that no need to add an 
#extra column for indexing <by default index = False>

In [10]:
sales_car = pd.read_csv("exported-indexFalsed-car-sales.csv")
sales_car_True = pd.read_csv("exported-indexTrue-car-sales.csv")

In [11]:
sales_car

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [12]:
sales_car_True

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

# Getting DataSet From GitHub Repository
heart_disease = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv")<br>
<b>Note: If you're using a link from GitHub, make sure it's in the "raw" format, by clicking the raw button.<\b>

# Describe Data

In [15]:
# Attribute - without parenthesis
# Atributes are just metaInfromation Stored about your Data
sales_car.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [16]:
sales_car.columns # columns name returned as a list

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [17]:
sales_car.index #information abour index

RangeIndex(start=0, stop=10, step=1)

In [18]:
sales_car

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [19]:
sales_car.describe()
#This a function as this has parenthesis
#functions performs some task on data
#.describe fucntions returns some statistical information on Data<only on Integer Data Types> i. e it works only on numeric values

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [21]:
sales_car.info()
#info is kind of like index combined with dtypes attributes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [23]:
sales_car.mean()
# gives average of numerical columns<integer type>

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [29]:
car_prices  = pd.Series([23232,232334,232323,232323]) ## creating a Series Data Type Just to Demonstrate What mean function does
car_prices.mean()

180053.0

In [30]:
sales_car.sum()
## combined all the columns

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [31]:
sales_car["Doors"].sum()
# running the sum function on a particular column

40

In [32]:
len(sales_car) #returns the number of rows in your DataFrame

10